# MixedDerivative Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceSecondDerivatives..::..MixedDerivative Property
FaceSecondDerivatives Class See Also
---
The mixed derivative.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ MixedDerivative { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MixedDerivative As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ MixedDerivative {
	XYZ^ get ();
}
```

# See Also
FaceSecondDerivatives Class
Autodesk.Revit.DB Namespace